app/controllers/rooms_controller.rb

SELECT  "rooms".* FROM "rooms"  WHERE (location LIKE '%qqq%' OR title LIKE '%qqq%' OR description LIKE '%qqq%')  ORDER BY created_at desc LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "rooms"  WHERE (location LIKE '%qqq%' OR title LIKE '%qqq%' OR description LIKE '%qqq%')
---
  def index
    @search_query = params[:q]

    rooms = Room.search(@search_query).
      page(params[:page]).
      per(PER_PAGE)

SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    room_model = Room.friendly.find(params[:id])

SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT 1  [["user_id", 8], ["id", 5]]
---
  def edit
    @room = current_user.rooms.friendly.find(params[:id])

INSERT INTO "rooms" ("created_at", "description", "location", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-30 00:15:33.430167"], ["description", "1"], ["location", "Goiania"], ["title", "Quarto da esquerda"], ["updated_at", "2015-01-30 00:15:33.430167"], ["user_id", 6]]
---
  def create
    @room = current_user.rooms.build(room_params)

    respond_to do |format|
      if @room.save

SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 3]]
---
  def destroy
    @room = current_user.rooms.friendly.find(params[:id])
    @room.destroy