app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
  	@user = User.find(params['id'])

INSERT INTO "users" ("bio", "confirmation_token", "created_at", "email", "full_name", "location", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@user = User.new(user_params)
  	if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
  	@user = User.find(params['id'])

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "full_name" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["full_name", "Wender JS Freese"], ["updated_at", "2015-01-27 00:15:19.243404"]]
---
  def update
  	@user = User.find(params['id'])
  	if @user.update(user_params)