app/controllers/rooms/reviews_controller.rb

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."room_id" = ? AND "reviews"."user_id" = 8 LIMIT 1  [["room_id", 7]]
UPDATE "rooms" SET "reviews_count" = COALESCE("reviews_count", 0) + 1 WHERE "rooms"."id" = 7
---
  def create
    review = room.reviews.find_or_initialize_by(user_id: current_user.id)

    review.update!(review_params)